# 1.2[4]. 
# Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, 
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# Примеры/Тесты:
# 6 >>>  1  4  1
# 24 >>> 4  16  4
# 60 >>> 10  40  10   

total_num = int(input("Введите количество журавликов: " ))
katya_num = total_num // 3 * 2
petya_and_seryozha = (total_num - katya_num) // 2
print(f"{petya_and_seryozha} {katya_num} {petya_and_seryozha}")
