# 8.1[49]: Создать телефонный справочник с возможностью импорта и экспорта данных в формате csv. 
# Доделать задание вебинара и реализовать Update, Delete
# Информация о человеке: Фамилия, Имя, Телефон, Описание
# Корректность и уникальность данных не обязательны.
# Функционал программы
# 1) телефонный справочник хранится в памяти в процессе выполнения кода.
# Выберите наиболее удобную структуру данных для хранения справочника.
# 2) CRUD: Create, Read, Update, Delete
# Create: Создание новой записи в справочнике: ввод всех полей новой записи, занесение ее в справочник.
# Read: он же Select. Выбор записей, удовлетворяющих заданном фильтру: по первой части фамилии человека. 
# Берем первое совпадение по фамилии.
# Update: Изменение полей выбранной записи. Выбор записи как и в Read, заполнение новыми значениями.
# Delete: Удаление записи из справочника. Выбор - как в Read.
# 3) экспорт данных в текстовый файл формата csv
# 4) импорт данных из текстового файла формата csv
# Используйте функции для реализации значимых действий в программе
# (*) Усложнение.
# Сделать тесты для функций
# Разделить на model-view-controller

import export_import as ex
import model as m

phone_book = []
# phone_book = [['Нехаев', "Михаил", "8900111", "друг"],
#               ["Петров", "Сергей", "8901222", "враг"]]

def menu(data: list):
    while True:
        print('Выберите действие: ')
        print('0 - выйти из справочника')
        print('1 - создать новую запись')
        print('2 - распечатать содержимое справочника')
        print('3 - выбрать запись по первой части фамилии')
        print('4 - изменить поле ')
        print('5 - удалить записи из справочника')
        print('6 - импортировать данные из текстового файла')
        print('7 - экспортировать данные в текстовый файл')

        get = input('Введите действие: ')
        if get == '0':
            print('До свидания!')
            break
        elif get == '1':
            data = m.create(data, m.get_data())
        elif get == '2':
            m.print_phone_book(data)
        elif get == '3':
            m.read(data)
        elif get == '4':
            m.update(data)
        elif get == '5':
            m.delete(data)
        elif get == '6':
            name_file = ex.get_file_name()
            batch_data = ex.get_batch_data(name_file)
            data = m.batch_create(data, batch_data)
        elif get == '7':
            name_file = ex.get_file_name()
            ex.record_data(name_file, data)
        else:
            print('Некорректный ввод данных, введите ещё раз: ')

menu(phone_book)